/**
 * @license
 * Copyright 2025 Google LLC
 * SPDX-License-Identifier: Apache-2.0
 *
 * Modifications copyright 2026 Luoshu Team.
 * Modified: banner replaced with 洛书 (Luoshu) rendered in 行楷 (Xingkai —
 * macOS system calligraphy font), downsampled to a 5-level shade ramp
 * (` ░▒▓█`) that preserves brush-stroke 浓淡 variation across the radial
 * gradient applied by RadialBanner.tsx.
 */

export const shortAsciiLogo = `
     ░░      ▓█▓░                        ▓▓▓▓   ░▒▒▒
     ▒██▓   ▒█████▒                      ▓▓██  ▒▒▓██▓
   ░░▓███▒▒▓██▓▓██▒                      █▓██▓▓░   ░
  ▓░   ▒▒▓███▒▒█▓░                    ░▓███████▓
  █▓▒  ░░░░▒▓███▓▒                  ░▓███▓▓██▓░
  ░▓█▓░    ▒█▓▒▒▓██▓▒░                   ▒▓██▒▒▒▒░
    ▓█░▒░▒█▓▒ ░▒▓▓▓█████▓▒            ░▓█████▓▒▒▒██▒
   ▒▒░▒█▓▒█▓▓███▓██▒▒▒▒▒▒▒░         ▒▓██▓▒▓█▓   ▒██▒
   ▒▒▓█░  ▓█▓░░░▓██░                ▓█▒░  ▒█▓▒▓██▓▒
   ▒██▒   ▒██▓▓███░                       ▓█▓▒▓▒░
    ▓█     ▒▓▒▒▒▒▒░                       ▓█▓
                                          ░▓▒
`;
